{"Search...": {"en": "Search SJII..."}, "Directions": {"en": "Show route"}, "Geolocation_permissions_denied": {"en": "Location permissions are allowed in the Settings app, selecting the Privacy option, and choosing the Location Services option. From here, you can pick the website you want to grant permissions to and select the Always option."}, "Geolocation_permissions_header": {"en": "Enable location services"}, "Geolocation_permissions_request": {"en": "You'll need to enable location to see and share your location. Is it OK if we ask to enable it?"}, "Follow the route to 08830a5f-0ca9-4349-b9f5-85070107e97b": {"en": "This is across the road from the Khoo Teck Puat Building and sandwiches between the upper and lower fields. Walk past the Solomon Block and follow the sheltered walkway to reach the destination"}, "Follow the route to 0b907eb6-796a-49b3-b088-2abf3611c487": {"en": "This is behind the Elementary School Gabriel Block. The Pavillion is in between the Elementary School Gabriel Block and Raphael Block"}, "Follow the route to 1f0150c4-8346-410d-8304-e7bbc647d6be": {"en": "This is across the way from the Khoo Teck Puat building and next to High School Basketball Court"}, "Follow the route to 22cbcb3b-71f9-4835-ae4a-62bdd9e5c7cd": {"en": "Please go to the foyer area, where there is a statue dedicated to Khoo Teck Puat"}, "Follow the route to 27614abe-9b2d-47c2-ae3f-ae82f95ad595": {"en": "This is next to the Sanctuary of Divine Love Chapel and across the way from the Khoo Teck Puat building. There is a statue dedicated to St Joseph at the front of the hall"}, "Follow the route to 49157f77-ea61-465d-9377-a8e8b390bba3": {"en": "Move past the gantry and look for a sign on your left that will point you to the Science Laboratories"}, "Follow the route to 5ef5cee6-65c8-4fa9-97a4-83189a3782c2": {"en": "This is close to the Toa Payoh exit/entrance"}, "Follow the route to 6bea1027-6c12-4e1e-a6f3-1e3ba39504e1": {"en": "These are next to the La Salle Block. Look for a flight of stairs heading down to the court from the High School Canteen"}, "Follow the route to 8049ecc1-d41a-45a3-8578-5e61ac192c6c": {"en": "This is behind the Raphael Block of the Elementary School"}, "Follow the route to 8ca77ee1-2e66-41cf-bed7-fd4e7db1d013": {"en": "This is next to the Elementary School Cecilia Block"}, "Follow the route to 9a5b07e5-fcac-4f4a-82c1-061f379ee3f3": {"en": "These are across the way from the Khoo Teck Puat building and next to the La Salle Block. To access the Music Rooms and the Blackbox (located on level 2), look for a flight of stairs next to the High School Canteen"}, "Follow the route to 9fab4531-b4ce-449a-8e5e-a1ed1986f5ed": {"en": "This is next to the upper field and across the way from the Khoo Teck Puat building"}, "Follow the route to b4e86452-0349-4860-95c3-b2513724eaf0": {"en": "This is next to the upper field and opposite the Sanctuary of Divine Love Chapel. If you are coming from the Solomon Block, go past the High School Music, Blackbox & Canteen"}, "Follow the route to caacc228-02ce-4d96-827c-6fdfe8d0ff49": {"en": "This is across the way from the High School Assembly Hall and next to the Sanctuary of Divine Love Chapel. The Nurse's Station and ESTV Studio are also found in this building"}, "Follow the route to d539c73b-732f-4230-8e41-868765c49e34": {"en": "Move past the Solomon Block and follow the sheltered walkway which leads to the Thomson entrance/exit"}, "Follow the route to e8625da8-c249-4895-9957-2f453bbfb026": {"en": "This is 2 blocks from the Khoo Teck Puat Building and past the High School Assembly Hall. If you are coming from the Solomon/Wisdom Block, you will need to crossover via the zebra crossing at the end of Wisdom Block Level 1"}, "Follow the route to fa5eab5d-faa7-433a-bdfe-8d82c6fec30c": {"en": "This is 2 blocks from the Elementary School Gabriel Block and past the Pavillion. The Elementary School Office is on Level 1 and the Elementary School Library is on Level 2"}}